casos/p04_conveccao/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
writeControl    timeStep;
writeInterval   500;
purgeWrite      1;
writeFormat     ascii;
writePrecision  6;
runTimeModifiable true;

functions
{
    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p);
    }
}
