casos/p04_conveccao/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  MCFT — Prática 4: Cavidade com tampa deslizante (lid-driven cavity)
  Quadrado 1m × 1m, 50×50 células, Re=100
  Demonstra efeito dos esquemas de convecção (upwind vs linear)
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

L   1.0;
h   0.01;

vertices
(
    (0  0  0)  ($L  0  0)  ($L  $L  0)  (0  $L  0)
    (0  0  $h) ($L  0  $h) ($L  $L  $h) (0  $L  $h)
);

blocks ( hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1) );

boundary
(
    lid          { type wall; faces ((3 2 6 7)); }  // tampa: U=(1 0 0)
    walls        { type wall; faces ((0 1 5 4)(1 2 6 5)(0 4 7 3)); }
    frontAndBack { type empty; faces ((0 1 2 3)(4 5 6 7)); }
);
