casos/p04_conveccao/constant/momentumTransport
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }
simulationType  laminar;
