casos/p04_conveccao/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
// Re = U*L/nu = 1*1/nu → nu=0.01 → Re=100
// Muda nu para explorar outros Re: 0.001→Re=1000, 1e-4→Re=10000
nu              nu [0 2 -1 0 0 0 0] 0.01;
