casos/p04_conveccao/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    lid   { type fixedValue; value uniform (1 0 0); }  // tampa a U=1 m/s
    walls { type noSlip; }
    frontAndBack { type empty; }
}
